import { customElement, property } from 'lit/decorators.js';
import { ifDefined } from 'lit/directives/if-defined.js';
import TailwindElement from '../../shared/tailwind.element';
import style from './label.scss?inline';
import { html } from 'lit';

/**
 * Label element.
 *
 * @text 내용 (필수값)
 * @preset 태그를 꾸며줄 css class (primary, secondary, tertiary ... 그 외)
 * @styled 태그를 꾸며줄 css style
 * @position 아이콘 위치 - default(아이콘 없는 상태), left, right
 * @width 아이콘 길이
 * @height 아이콘 높이
 */
@customElement('dwc-label')
export class Label extends TailwindElement(style) {
  @property() text: string = '';
  @property() preset?: string = 'primary';
  @property() styled?: Partial<CSSStyleDeclaration>;
  @property() position?: 'left' | 'right' | 'default' = 'default';
  @property() width?: number = 24;
  @property() height?: number = 24;

  // 아이콘 컴포넌트 적용 후 svg 컴포넌트 import 예정
  render() {
    return html`
    <div
      style=${ifDefined(this.styled)}
      class=${['label-wrapper', this.position, this.preset].join(" ")}
    >
      <svg
        width="${this.width}"
        height="${this.height}"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M14.3514 17.5556H10.2072C10.0244 17.5556 9.87202 17.4947 9.75013 17.3831C9.62824 17.2714 9.55714 17.1192 9.55714 16.9366C9.55714 16.7742 9.61808 16.6322 9.75013 16.5104C9.87202 16.3886 10.0244 16.3278 10.2072 16.3278H11.5886V11.2948H10.3494C10.1666 11.2948 10.0142 11.2339 9.89233 11.1121C9.77044 11.0005 9.7095 10.8483 9.7095 10.6657C9.7095 10.4932 9.77044 10.3511 9.90249 10.2293C10.0244 10.1076 10.1767 10.0467 10.3494 10.0467H12.2793C12.5028 10.0467 12.6755 10.1177 12.7872 10.2598C12.8989 10.4018 12.9599 10.5946 12.9599 10.828V16.3176H14.3413C14.5241 16.3176 14.6765 16.3785 14.7984 16.5003C14.9203 16.622 14.9812 16.7641 14.9812 16.9264C14.9812 17.1091 14.9203 17.2613 14.7984 17.3729C14.6866 17.5048 14.5343 17.5556 14.3514 17.5556ZM11.9441 8.25063C11.6089 8.25063 11.3347 8.13902 11.1011 7.90563C10.8573 7.67225 10.7354 7.39827 10.7354 7.06342C10.7354 6.72856 10.8573 6.44444 11.0909 6.21106C11.3245 5.97768 11.6089 5.86606 11.934 5.86606C12.2692 5.86606 12.5434 5.97768 12.777 6.21106C13.0107 6.44444 13.1224 6.72856 13.1224 7.06342C13.1224 7.39827 13.0107 7.67225 12.777 7.90563C12.5536 8.13902 12.2692 8.25063 11.9441 8.25063ZM12.0051 22C13.3763 22 14.6663 21.7362 15.8649 21.2187C17.0635 20.7012 18.1402 19.9706 19.0543 19.0573C19.9787 18.1339 20.6998 17.0685 21.2179 15.8711C21.7359 14.6636 22 13.3749 22 12.0152C22 10.6454 21.7359 9.35667 21.2179 8.15931C20.6998 6.9518 19.9685 5.88635 19.0543 4.97311C18.1402 4.02943 17.0736 3.30898 15.8649 2.78133C14.6562 2.26383 13.3662 2 11.9949 2C10.6338 2 9.34383 2.26383 8.13509 2.78133C6.92636 3.30898 5.86998 4.02943 4.94566 4.95282C4.03149 5.86606 3.31031 6.93151 2.78212 8.13902C2.25394 9.34653 2 10.6352 2 11.9949C2 13.3648 2.26409 14.6535 2.78212 15.8508C3.30015 17.0482 4.03149 18.1238 4.95582 19.0472C5.88014 19.9706 6.94667 20.691 8.14525 21.2085C9.34383 21.726 10.644 22 12.0051 22Z"
          fill="currentColor"
        />
      </svg>
      ${this.text}
    </div>`;
  }
}

declare global {
  interface HTMLElementTagNameMap {
    'dwc-label': Label;
  }
}
